import java.util.*;


/**
 * # 테스트 문제
 * ### 문제 2
 *
 * 하루 동안 시간별 주문 건수가 주어집니다.
 *
 * ```
 * orders = [3, 2, 7, 1, 4, 8, 2, 5]
 * k = 4
 * ```
 *
 * **연속된 4시간** 동안 발생한 주문 건수의 합이 가장 큰 구간의 합을 구하세요.
 *
 * ```
 * [3,2,7,1]
 *   [2,7,1,4]
 *     [7,1,4,8]
 *       ...
 * ```
 *
 * `orders.length`는 최대 `1,000,000`입니다.
 */
class Problem02 {
    /*
     * 1. 무엇을 구해야 하는가?
     * → 길이 K인 모든 연속 구간 중 최대 합
     *
     * 2. 단순하게 어떻게 풀까?
     * → 가능한 모든 시작 위치에서 K개를 직접 더한다.
     *
     * 3. 몇 개의 구간이 존재하는가?
     * → N-K+1개 ≈ O(N)
     *
     * 4. 구간 하나 계산 비용은?
     * → K개를 더하므로 O(K)
     *
     * 5. 전체 시간복잡도는?
     * → O((N-K+1)K)
     * → 일반적으로 O(NK)
     * → K도 N에 비례해 커질 수 있으므로 최악 O(N²)
     *
     * 6. N 최대 1,000,000이면?
     * → 불가능
     *
     * 7. 반복해서 계산되는 부분은 무엇인가?
     * → K 구간의 합을 구한뒤 한칸씩 앞뒤로 계산을 진행
     * → 구간을 한 칸 이동할 때 K-1개의 원소가 겹치는데, 이 원소들의 합을 매번 다시 계산한다.
     *
     * 8. 어떻게 개선할 수 있을까?
     * → 길이가 K로 고정되어 있으므로 슬라이딩 윈도우를 사용
     *
     * 9. 개선한 방법의 시간복잡도는?
     * → O(N^2)대신 O(N)
     */

    public long solution(int[] orders, int k) {
        int left = 0;
        long max = Long.MIN_VALUE;
        long sum = 0;

        for (int right = 0; right < orders.length; right++) {
            sum += orders[right];

            if (right - left + 1 == k) {
                if (sum > max) {
                    max = sum;
                }
                sum -= orders[left];
                left++;
            }
        }

        return max;
    }
}